### Terraform Apply Results:
```
random_id.bucket_suffix: Refreshing state... [id=IUUDkg]
random_id.bucket_id: Refreshing state... [id=DLnwNg]
aws_s3_bucket.example4: Refreshing state... [id=my-example-bucket4-21450392]
data.aws_ami.amazon_linux_2: Reading...
aws_iam_role.ec2_role: Refreshing state... [id=terraform_iam_role]
aws_s3_bucket.example6: Refreshing state... [id=my-example-bucket6-21450392]
aws_s3_bucket.kafka_bucket: Refreshing state... [id=kafka-bucket-0cb9f036]
aws_s3_bucket.example5: Refreshing state... [id=my-example-bucket5-21450392]
aws_dynamodb_table.tf_lock_table: Refreshing state... [id=terraform-lock-table]
aws_vpc.main: Refreshing state... [id=vpc-05ed0a2afe2724e13]
aws_iam_policy.terraform_policy: Refreshing state... [id=arn:aws:iam::703671893205:policy/terraform_full_access_policy]
aws_s3_bucket.tf_state_bucket: Refreshing state... [id=my-unique-tfstate-bucket-1234]
aws_s3_bucket.example3: Refreshing state... [id=my-example-bucket3-21450392]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=terraform_instance_profile]
aws_iam_role_policy_attachment.attach_terraform_policy: Refreshing state... [id=terraform_iam_role-20250222190645536000000001]
aws_s3_bucket_public_access_block.tf_state_bucket_block: Refreshing state... [id=my-unique-tfstate-bucket-1234]
aws_s3_bucket_public_access_block.bucket_block: Refreshing state... [id=kafka-bucket-0cb9f036]
data.aws_ami.amazon_linux_2: Read complete after 0s [id=ami-0c104f6f4a5d9d1d5]
aws_subnet.public: Refreshing state... [id=subnet-064b2fa8425e5b9b6]
aws_internet_gateway.igw: Refreshing state... [id=igw-07e5400c533247667]
aws_security_group.allow_customip: Refreshing state... [id=sg-09a39cb2cb394d094]
aws_route_table.public: Refreshing state... [id=rtb-0d15564cb3b378d48]
aws_instance.web: Refreshing state... [id=i-00db76b7c6743caa9]
aws_instance.jenkins-runner: Refreshing state... [id=i-09618af6a96474ccc]
aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-08b3f4848f6a8e104]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web4tf will be created
  + resource "aws_instance" "web4tf" {
      + ami                                  = "ami-0c104f6f4a5d9d1d5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-064b2fa8425e5b9b6"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09a39cb2cb394d094",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_instance.web4tf: Creating...
aws_instance.web4tf: Still creating... [10s elapsed]
aws_instance.web4tf: Creation complete after 12s [id=i-09f9d58c880c9889b]

Warning: Argument is deprecated

  with aws_s3_bucket.tf_state_bucket,
  on s3-lock.tf line 1, in resource "aws_s3_bucket" "tf_state_bucket":
   1: resource "aws_s3_bucket" "tf_state_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 24 more similar warnings elsewhere)

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

ec2_instance_id = "i-00db76b7c6743caa9"
ec2_instance_public_ip = "34.201.167.68"
internet_gateway_id = "igw-07e5400c533247667"
public_subnet_id = "subnet-064b2fa8425e5b9b6"
s3_bucket_arn = "arn:aws:s3:::kafka-bucket-0cb9f036"
s3_bucket_name = "kafka-bucket-0cb9f036"
vpc_id = "vpc-05ed0a2afe2724e13"

```